Revit 2027 API
ParameterTypeId.StairstypeNumberOfIntermediateSupports Property
 "Middle Support Number": Number of intermediate supports
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeNumberOfIntermediateSupports { get; }
Public Shared ReadOnly Property StairstypeNumberOfIntermediateSupports As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeNumberOfIntermediateSupports {
	ForgeTypeId^ get ();
}
static member StairstypeNumberOfIntermediateSupports : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace